tla.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-13 Wed 10:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>moo 無 tla</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="other/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="other/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">moo 無 tla
<br />
<span class="subtitle">Parameterized <code>moo</code> Jsonnet</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">Overview</a></li>
<li><a href="#extvar">External Variables</a></li>
<li><a href="#tla">Top-Level Arguments</a>
<ul>
<li><a href="#notla">Non-functional Jsonnet file</a></li>
<li><a href="#tlfunc">Refactor to top-level function</a></li>
<li><a href="#tlaoncli">Provide TLA value on CLI</a></li>
<li><a href="#tlfuncinjsonnet">Using top-level function from Jsonnet</a></li>
</ul>
</li>
<li><a href="#mootla">Taking TLA further with <b>moo</b></a>
<ul>
<li><a href="#tlaclicode">TLA code on command line</a></li>
<li><a href="#tlajsonnetfile">TLA value from Jsonnet file</a></li>
<li><a href="#tlaanyfile">TLA value from any file</a></li>
</ul>
</li>
<li><a href="#guidance">When or when not to use TLA</a></li>
</ul>
</div>
</div>

<div id="outline-container-overview" class="outline-2">
<h2 id="overview">Overview</h2>
<div class="outline-text-2" id="text-overview">
<p>
When making a <b>moo</b> schema or other data structures in Jsonnet one often
finds that some aspect can be nicely factored out so as to make the
Jsonnet file more general.
</p>

<p>
Here we describe two ways that Jsonnet supports such factoring of
information.  <b>moo</b> rejects the first approach for reasons explained.
</p>
</div>
</div>

<div id="outline-container-extvar" class="outline-2">
<h2 id="extvar">External Variables</h2>
<div class="outline-text-2" id="text-extvar">
<p>
Jsonnet provides a useful mechanism called "external variables".  It
is similar to querying the <code>os.environ</code> dictionary in Python.  You may
use it in Jsonnet anywhere you might use a value.  For example:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #73d216;">// extvar.jsonnet</span>
<span style="color: #b4fa70;">local</span> myvar = std.extVar(<span style="color: #e9b96e;">"MY_EXTERNAL_VARIABLE"</span>);
{
  abc: <span style="color: #e9b96e;">"Answer: %d"</span> % myvar,
  xyz: <span style="color: #e9b96e;">"Command line says, %s"</span> % std.extVar(<span style="color: #e9b96e;">"MY_OTHER_VARIABLE"</span>),
}
</pre>
</div>

<p>
Using <code>jsonnet</code> directly you may compile this code with a command like:
</p>

<pre class="example">
$ jsonnet -V MY_OTHER_VARIABLE="hello" -V MY_EXTERNAL_VARIABLE=42 extvar.jsonnet
</pre>

<p>
The <code>std.extVar()</code> form is very easy to use when writing Jsonnet but one
quickly sees limitations.  This is one place where <b>moo</b> is opinionated
and so does not offer an equivalent to <code>jsonnet -V</code>.  The reasons for
this are:
</p>

<ul class="org-ul">
<li>There is no way to provide a default value so the user <b>must always</b>
provide values.</li>

<li>There is no way to provide values internally in Jsonnet (the feature
is called <b>external variables</b> after all).  This limits ability to
compose the Jsonnet into ever higher order structure.</li>

<li>This is effectively a "global variable" anti-pattern.  One must
analyze the body of code to understand where the external variables
are applied.</li>
</ul>
</div>
</div>

<div id="outline-container-tla" class="outline-2">
<h2 id="tla">Top-Level Arguments</h2>
<div class="outline-text-2" id="text-tla">
<p>
Happily, Jsonnet provides a second feature to "inject" values into
Jsonnet code which addresses the problems with "external variables".
It is called "top-level arguments" or TLA.  <b>moo</b> not just supports TLA
but embraces it.
</p>

<p>
TLA works with a Jsonnet file that produces as its top-level result a
Jsonnet <code>function</code> object.  It is the arguments to this top-level
function which are the TLAs.  Jsonnet function arguments may be given
default values and this removes one problem with the use of
<code>std.extVar()</code>.  And, given that the Jsonnet <code>function</code> may be evaluated
as the top-level compiled object or called from other higher-level
Jsonnet removes the other.  Finally, since it is a functional
programming pattern it is easy for developers to trace how the
information is used.
</p>

<p>
Okay, on to how to use it.  
</p>
</div>

<div id="outline-container-notla" class="outline-3">
<h3 id="notla">Non-functional Jsonnet file</h3>
<div class="outline-text-3" id="text-notla">
<p>
Let's start with some "non-functional" code (it works, but does not
use a top-level function):
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> var=<span style="color: #e9b96e;">"hello"</span>;
<span style="color: #b4fa70;">local</span> result=<span style="color: #e9b96e;">"%s"</span>%var;
result
</pre>
</div>

<p>
This example is rather contrived.  The <code>var</code> will be our variable of
interest.  The <code>result</code> represents some intermediate structure
construction, possibly very complex in a real world use.  The last
line provides the value of the file as a whole.
</p>

<p>
We may compile this with <code>moo</code> or <code>jsonnet</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell">moo compile examples/tla/notla.jsonnet
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #e9b96e;">"hello"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-tlfunc" class="outline-3">
<h3 id="tlfunc">Refactor to top-level function</h3>
<div class="outline-text-3" id="text-tlfunc">
<p>
To refactor this code, we define a top-level <code>function</code> and move <code>var</code>
into its argument list and its body holds the intermediate structure
construction:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">function</span> (var=<span style="color: #e9b96e;">"hello"</span>) {
    <span style="color: #b4fa70;">local</span> result = <span style="color: #e9b96e;">"%s"</span>%var,
    return: result
}.return
</pre>
</div>

<p>
There are certainly other ways to "shape" the function body.  What is
shown here is the use of an "inside-out pattern".  The inner <code>result</code>
value is used to hold the final construction in the context of an
object.  We then set another value called <code>return</code> which is exposed as
the value of the <code>function</code>.  This is admittedly overkill for this
simple example but shows a common pattern used when the structure
requires various intermediates.
</p>

<p>
Because of the default value for the TLA we may compile it as before:
</p>

<div class="org-src-container">
<pre class="src src-shell">moo compile examples/tla/tla.jsonnet
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #e9b96e;">"hello"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-tlaoncli" class="outline-3">
<h3 id="tlaoncli">Provide TLA value on CLI</h3>
<div class="outline-text-3" id="text-tlaoncli">
<p>
And, finally, we may see how to actually "inject" a variant value:
</p>

<div class="org-src-container">
<pre class="src src-shell">moo -A <span style="color: #fcaf3e;">var</span>=<span style="color: #e9b96e;">"hello world"</span> compile examples/tla/tla.jsonnet
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #e9b96e;">"hello world"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-tlfuncinjsonnet" class="outline-3">
<h3 id="tlfuncinjsonnet">Using top-level function from Jsonnet</h3>
<div class="outline-text-3" id="text-tlfuncinjsonnet">
<p>
And one more example shows how we may reuse this same <code>tla.jsonnet</code> as
ingredients to build yet higher-level structure in Jsonnet.
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> tla = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"tla.jsonnet"</span>;
tla(<span style="color: #e9b96e;">"hi from inside Jsonnet!"</span>)
</pre>
</div>

<p>
Here, we provide a hard-wired value for the <code>var</code>.  Of course, this
Jsonnet file also could instead provide a <code>function</code> with TLAs and we
may continue the trend.  But, for simplicity we cap off the pattern. 
</p>

<p>
Here is the exciting result:
</p>

<div class="org-src-container">
<pre class="src src-shell">moo compile examples/tla/usetla.jsonnet
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #e9b96e;">"hi from inside Jsonnet!"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-mootla" class="outline-2">
<h2 id="mootla">Taking TLA further with <b>moo</b></h2>
<div class="outline-text-2" id="text-mootla">
<p>
Jsonnet allows setting of TLAs to simple scalar values as well as
Jsonnet structure and <b>moo</b> takes this further to allow TLAs to be set
with values or structure provided in any support <b>moo</b> format.  
</p>

<p>
Some examples follow to show the power.  
</p>
</div>

<div id="outline-container-tlaclicode" class="outline-3">
<h3 id="tlaclicode">TLA code on command line</h3>
<div class="outline-text-3" id="text-tlaclicode">
<p>
First we may write some Jsonnet code
directly on the command line.
</p>

<div class="org-src-container">
<pre class="src src-shell">moo -A <span style="color: #fcaf3e;">var</span>=<span style="color: #e9b96e;">"{a:42, b:'Jsonnet code from the CLI'}.b"</span> compile examples/tla/tla.jsonnet
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #e9b96e;">"Jsonnet code from the CLI"</span>
</pre>
</div>

<p>
Here, we use the "inside-out pattern" again because <code>tla.jsonnet</code>
ultimately expects <code>var</code> to be a string.  Other Jsonnet TLA may expect
some complex structure and we could supply that.  Take this most
trivial function:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">function</span>(var={}) var
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">moo -A <span style="color: #fcaf3e;">var</span>=<span style="color: #e9b96e;">"{a:42, b:'Jsonnet code from the CLI'}"</span> compile examples/tla/passthrough.jsonnet
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #b4fa70;">"a"</span>: <span style="color: #e9b2e3;">42</span>,
    <span style="color: #b4fa70;">"b"</span>: <span style="color: #e9b96e;">"Jsonnet code from the CLI"</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-tlajsonnetfile" class="outline-3">
<h3 id="tlajsonnetfile">TLA value from Jsonnet file</h3>
<div class="outline-text-3" id="text-tlajsonnetfile">
<p>
<b>moo</b> goes even further and checks if the <code>-A</code> argument "looks like" a file.
</p>

<div class="org-src-container">
<pre class="src src-shell">moo -A <span style="color: #fcaf3e;">var</span>=examples/tla/notla.jsonnet compile examples/tla/passthrough.jsonnet
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #e9b96e;">"hello"</span>
</pre>
</div>

<p>
Here, we have reused the <code>notla.jsonnet</code> file but now its value is
"injected" back into Jsonnet via <code>var</code>.  Of course, compared to a
pure-Jsonnet context this routing is very circuitous compared to using
Jsonnet <code>import</code>. 
</p>

<p>
However, it allows for <b>moo</b> to provide one more trick.  Any TLA value
which "looks like" a file to <b>moo</b> will be parsed and <b>moo</b> knows how to
parse many languages (thanks to <a href="https://pypi.org/project/anyconfig/">anyconfig</a>).  
</p>
</div>
</div>

<div id="outline-container-tlaanyfile" class="outline-3">
<h3 id="tlaanyfile">TLA value from any file</h3>
<div class="outline-text-3" id="text-tlaanyfile">
<p>
This opens the door to a bit of craziness where one may supply data in
JSON, INI, YAML, CSV, XLS spreadsheets or even XML:
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #fce94f;">data</span>&gt;
  &lt;<span style="color: #fce94f;">a</span>&gt;42&lt;/<span style="color: #fce94f;">a</span>&gt;
  &lt;<span style="color: #fce94f;">b</span>&gt;Hello from XML!&lt;/<span style="color: #fce94f;">b</span>&gt;
&lt;/<span style="color: #fce94f;">data</span>&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">moo -A <span style="color: #fcaf3e;">var</span>=examples/tla/data.xml compile examples/tla/passthrough.jsonnet
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #b4fa70;">"data"</span>: {
        <span style="color: #b4fa70;">"a"</span>: <span style="color: #e9b96e;">"42"</span>,
        <span style="color: #b4fa70;">"b"</span>: <span style="color: #e9b96e;">"Hello from XML!"</span>
    }
}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-guidance" class="outline-2">
<h2 id="guidance">When or when not to use TLA</h2>
<div class="outline-text-2" id="text-guidance">
<p>
It is almost never "wrong" to structure a Jsonnet file as a top-level
function.  At most, it means wrapping the otherwise top-level result
in a <code>function()</code> and maybe adding the "inside-out" pattern.  But this
small cost makes the Jsonent file useful in more contexts.
</p>

<p>
The real effort is of course in factoring the code itself.  But then,
that's the point.  In the process of factoring one may find that parts
can be abstracted into many files each providing a top-level
<code>function()</code>.  Thus is the nature of well factored, functional
programming.
</p>

<p>
One caution to consider.  In applying TLA one should be sensitive to
how the abstracted information that will be fed back through TLAs will
ultimately be provided.  In the context of a <a href="buildsys.html">build system</a> it may go
into, eg, CMake files.  One should evaluate if adding complexity there
makes sense.  To best provide an "external" TLA interface consider
providing one or more layers of outer Jsonnet scope to "whittle down"
the amount of abstracted parameters by providing sane defaults along
the way.  
</p>

<p>
One example of this layering from <b>moo</b> is how the <a href="oschema">omodel</a> is used to
connect a simple array of type schema structures to an overall schema
expected by some of the codegen templates.  The "model" is "just
another Jsonnet" file and can house default values and bring together
structure.  
</p>

<p>
Both values and structure can be provided on the <code>moo</code> command line (see
various main options to <code>moo</code>) but that puts more structure outside of
Jsonnet which means the user must remember the right CLI args or the
script or build system calling <code>moo</code> grows more complex, etc.  Striking
a balance can take "trial and anger" to get right.  
</p>

<p>
When in doubt, use TLAs and provide another layer of Jsonnet!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren</p>
<p class="date">Created: 2021-01-13 Wed 10:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
